# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# A file that lists Brew formulae and taps to install resp. add on Macos
#
# https://openfolder.sh/macos-migrations-with-brewfile
# https://github.com/Homebrew/homebrew-bundle
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#
#~~~~~~~~~~~~~~~~~~~~
# Brew Taps (Sources)
#~~~~~~~~~~~~~~~~~~~~
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "theseal/ssh-askpass"
tap "thoughtbot/formulae"
# tap "universal-ctags/universal-ctags"

#~~~~~~~~~~~~~~~~~~~~
# Brew Formulae (Packages)
#~~~~~~~~~~~~~~~~~~~~
brew 'ansifilter'
brew 'asciinema'

brew 'autoconf'
brew 'automake'
#
# colorful diffs (alias diff='colordiff -u')
brew 'colordiff'

brew 'coreutils'
brew 'ctags'
brew 'curl'


brew 'diff-so-fancy'
brew 'direnv'
brew 'dos2unix'

# Ruby Version Manager (written in Go)
brew 'frum'
brew 'fswatch'
# Fuzzy File finder
brew 'fzf'

# Github CLI
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-flow-avh'
brew 'git-standup'
brew 'git-subrepo'
brew 'gnupg'

brew 'heroku/brew/heroku'
brew 'htop'
brew 'httrack'
# Github CLI interface
brew 'hub'


# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew 'jq'



brew 'mas' # Mac AppStore CLI
brew 'md5sha1sum'

# Sniff network trafic
brew 'ngrep'

brew 'numpy'

# Procfile manage: a foreman++
brew 'overmind'


#egrep for processes
brew 'pgrep'
brew 'pstree'

# brew 'rbenv'
# brew 'rbenv-binstubs'
# brew 'rbenv-bundler'
# brew 'rbenv-ctags'
# brew 'rbenv-default-gems'

brew 'readline'
brew 'redis', restart_service: true

# For tmux to handle clipboard
brew 'reattach-to-user-namespace'

brew 'ruby-build'

# Dotfiles Installer
brew 'thoughtbot/formulae/rcm'

brew 'sqlite'
brew 'theseal/ssh-askpass/ssh-askpass'

# lightning fast search (ag)
brew 'the_silver_searcher'

brew 'tmux'
brew 'tree'
brew 'urlview'

brew 'vim'
brew 'vlc'

brew 'watch'

brew 'yarn'

brew 'zsh'
brew 'zsh-syntax-highlighting'


#~~~~~~~~~~~~~~~~~~~~
# MacOS Applications
#~~~~~~~~~~~~~~~~~~~~
mas "Key Codes", id: 414568915
mas "iZip", id: 478738838
mas "CheatSheet", id: 529456740
mas "Amphetamine", id: 937984
mas "Skitch", id: 425955336
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "XChat Azure", id: 447521961


# ~~~~~~~~
# Casks
# ~~~~~~~~
cask 'docker'
cask 'keycastr'
cask 'iterm2'
cask 'lepton'
cask 'obsidian'
cask 'postman'
cask 'vlc'
cask 'zoom'
cask 'karabiner-elements'
