# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# A file that lists the:
# - Brew taps to add
# - Brew formulae to install
# - MacOS apps to install
#
# To install what is listed in this file:
#     brew bundle
#
# Sources:
# - https://openfolder.sh/macos-migrations-with-brewfile
# - https://github.com/Homebrew/homebrew-bundle
# - https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#
#~~~~~~~~~~~~~~~~~~~~
# Brew Taps (Sources)
#~~~~~~~~~~~~~~~~~~~~
tap "1password/tap"
tap "espanso/espanso"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "theseal/ssh-askpass"
tap "thoughtbot/formulae"
# tap "universal-ctags/universal-ctags"

#~~~~~~~~~~~~~~~~~~~~
# Brew Formulae (Packages)
#~~~~~~~~~~~~~~~~~~~~
brew 'ansifilter'
brew 'asciinema'
brew 'awscli'

brew 'autoconf'
brew 'automake'
#
# colorful diffs (alias diff='colordiff -u')
brew 'colordiff'

brew 'coreutils'
brew 'ctags'
brew 'curl'


brew 'diff-so-fancy'
brew 'direnv'
brew 'dos2unix'

brew "espanso"
brew "extract_url"
brew 'font-meslo-lg-nerd-font'
brew 'frum'
brew 'fswatch'
# Fuzzy File finder
brew 'fzf'
brew "fpp"

# Github CLI
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-flow-avh'
brew 'git-subrepo'
brew 'gnupg'

brew 'heroku/brew/heroku'
brew 'htop'
brew 'httrack'
# Github CLI interface
brew 'hub'


# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew 'jq'



brew 'lazygit'
brew 'mas' # Mac AppStore CLI
brew 'md5sha1sum'

# Sniff network trafic
brew 'ngrep'

brew 'numpy'
brew 'neovim'
brew 'node'

# Procfile manage: a foreman++
brew 'overmind'

brew 'openssl'

#egrep for processes
brew 'pgrep'
brew 'pstree'

# Shell Prompt Theme
brew 'powerlevel10k'

# brew 'rbenv'
# brew 'rbenv-binstubs'
# brew 'rbenv-bundler'
# brew 'rbenv-ctags'
# brew 'rbenv-default-gems'

brew 'readline'
brew 'redis', restart_service: true

# For tmux to handle clipboard
brew 'reattach-to-user-namespace'
brew 'rg'

brew 'ruby-build'

brew 'sqlite3'
brew 'starship'
brew 'theseal/ssh-askpass/ssh-askpass'

# Dotfiles Installer
brew 'thoughtbot/formulae/rcm'

# lightning fast search (ag)
brew 'the_silver_searcher'

brew 'tmux'
brew 'tree'
brew 'urlview'

brew 'vim'

brew 'watch'

brew 'yarn'

brew 'xz' 
brew 'zlib'
brew 'zoxide'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

#~~~~~~~~~~~~~~~~~~~~
# MacOS Applications
#~~~~~~~~~~~~~~~~~~~~
mas 'Things', id: 904280696

# ~~~~~~~~
# Casks
# ~~~~~~~~
cask '1password-cli'
cask 'docker'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keycastr'
cask 'lepton'
cask 'notunes'
cask 'obsidian'
cask 'postman'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'wezterm"'
cask 'zoom'
