# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# A file that lists Brew formulae and taps to install resp. add on Macos
#
# https://github.com/Homebrew/homebrew-bundle
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


brew 'ansifilter'
brew 'autoconf'
brew 'automake'
#
# colorful diffs (alias diff='colordiff -u')
brew 'colordiff'

brew 'coreutils'
brew 'ctags'

brew 'diff-so-fancy'
brew 'dos2unix'

brew 'fswatch'
#
# Fuzzy File finder
brew 'fzf'

# Fuzzy File finder
brew 'fzf'

brew 'git-extras'
brew 'git-flow'
brew 'git-standup'
brew 'git-subrepo'

brew 'htop-osx'

# Github CLI interface
brew 'hub'

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew 'jq'

brew 'md5sha1sum'

# Sniff network trafic
brew 'ngrep'

#egrep for processes
brew 'pgrep'

# brew 'rbenv'
# brew 'rbenv-binstubs'
# brew 'rbenv-bundler'
# brew 'rbenv-ctags'
# brew 'rbenv-default-gems'

brew 'readline'

# For tmux to handle clipboard
brew 'reattach-to-user-namespace'

brew 'ruby-build'

# Dotfiles Installer
brew 'rcm'

# lightning fast search (ag)
brew 'the_silver_searcher'

brew 'tmux'
brew 'tree'
brew 'urlview'

brew 'vim'

brew 'watch'

brew 'zsh'
brew 'zsh-syntax-highlighting'

if ENV.fetch("SHELL", "") != "/usr/local/bin/zsh"
  puts "To use the Homebrew-installed ZSH:"
  puts "  sudo echo /usr/local/bin/zsh >> /etc/shells"
  puts "  chsh -s /usr/local/bin/zsh"
end

# ~~~~~~~~
# Cask
# ~~~~~~~~

cask 'alfred'
cask 'dropbox'
cask 'google-chrome'
cask 'vlc'

# Keyboard remapping on macOS
cask 'karabiner-elements'

